MyHome/src/Enums/ВидыДвиженийДенежныхСредств/ВидыДвиженийДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийДенежныхСредств</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/Documents/мх_РегистрацияРасходов/мх_РегистрацияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_РегистрацияРасходов</name>
  <registerRecords>AccumulationRegister.мх_ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_Расходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.мх_КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.мх_СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнеБюджета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнеБюджета</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/мх_РегистрацияДоходов/мх_РегистрацияДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_РегистрацияДоходов</name>
  <registerRecords>AccumulationRegister.мх_ПланированиеБюджета</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.мх_Доходы</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.мх_КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.мх_СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнеплановыйДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <type>
        <types>Characteristic.мх_СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнеплановыйДоход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Catalogs/мх_Автоплатежи/мх_Автоплатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мх_Автоплатежи</name>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.мх_КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.мх_СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.мх_СтатьиРасходов</types>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/CommonModules/мх_АвтоплатежиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыполнитьОбработкуАвтоплатежа(Автоплатеж) Экспорт

	Результат = Новый Структура("Успех, ОписаниеОшибки", Истина, "");

	Реквизиты = "ВидПлатежа,Сумма,СтатьяДоходовРасходов,Кошелек,АналитикаДоходов,АналитикаРасходов";
	РеквизитыПлатежа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Автоплатеж, Реквизиты);

	Если РеквизитыПлатежа.ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.Расход") Тогда
		Результат = СоздатьРасход(РеквизитыПлатежа);
	ИначеЕсли РеквизитыПлатежа.ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.Доход") Тогда
		Результат = СоздатьДоход(РеквизитыПлатежа);
	Иначе
		ВызватьИсключение НСтр("ru = 'Необрабатываемый формат платежа'");
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРасписаниеАвтоплатежа(Знач ИдентификаторРегламентногоЗадания) Экспорт
	
	Возврат мх_РегламентныеЗадания.ПолучитьРасписаниеРегламентногоЗадания(ИдентификаторРегламентногоЗадания, "мх_ОбработкаАвтоплатежей");

КонецФункции

Процедура УстановитьРасписаниеАвтоплатежа(Знач АвтоплатежОбъект, Расписание, Использование) Экспорт
	
	мх_РегламентныеЗадания.УстановитьРасписаниеРегламентногоЗадания(АвтоплатежОбъект,
																 "мх_ОбработкаАвтоплатежей",
																 Расписание,
																 Использование);

КонецПроцедуры

Процедура ВыполнитьОбработкуАвтоплатежей(ИдентификаторыПлатежей) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыПлатежей", ИдентификаторыПлатежей);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Автоплатежи.Ссылка,
	|	Автоплатежи.ПометкаУдаления,
	|	Автоплатежи.Используется
	|ИЗ
	|	Справочник.мх_Автоплатежи КАК Автоплатежи
	|ГДЕ
	|	Автоплатежи.ИдентификаторРегламентногоЗадания В (&ИдентификаторыПлатежей)";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Если Не Выборка.Используется Или Выборка.ПометкаУдаления Тогда
			ВызватьИсключение НСтр("ru = 'Автоплатеж не используется'");
		КонецЕсли;

		Результат = ВыполнитьОбработкуАвтоплатежа(Выборка.Ссылка);

		Если Не Результат.Успех Тогда
			ВызватьИсключение Результат.ОписаниеОшибки;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Функция СоздатьРасход(Знач РеквизитыПлатежа)

	Результат = Новый Структура("Успех, ОписаниеОшибки", Истина, "");

	ПараметрыРасхода = РеквизитыПлатежа;
	ПараметрыРасхода.Вставить("СтатьяРасходов", РеквизитыПлатежа.СтатьяДоходовРасходов);
	ПараметрыРасхода.Вставить("АналитикаРасходов", РеквизитыПлатежа.АналитикаРасходов);
	ПараметрыРасхода.Вставить("Комментарий", "Создан автоматически");

	Попытка
		Результат = Документы.мх_РегистрацияРасходов.ДобавитьРасход(ПараметрыРасхода);
	Исключение
		Результат.Успех = Ложь;
		Результат.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция СоздатьДоход(Знач РеквизитыПлатежа)

	Результат = Новый Структура("Успех, ОписаниеОшибки", Истина, "");

	ПараметрыДохода = РеквизитыПлатежа;
	ПараметрыДохода.Вставить("СтатьяДоходов", РеквизитыПлатежа.СтатьяДоходовРасходов);
	ПараметрыДохода.Вставить("АналитикаДоходов", РеквизитыПлатежа.АналитикаДоходов);
	ПараметрыДохода.Вставить("Комментарий", "Создан автоматически");

	Попытка
		Результат = Документы.мх_РегистрацияДоходов.ДобавитьДоход(ПараметрыДохода);
	Исключение
		Результат.Успех = Ложь;
		Результат.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции
#КонецОбласти
